{"0": "1. Purpose: This document outlines and describes the process associated with managing existing inventory of Parker Wellbore (PW) organization contracts with customers (Revenue Contracts) and preparation of contract variation documents, as may be required from time to time, during contract life cycle (hereinafter – “Contract Management Process”). 2. Scope: a. This document applies to all personnel who have or potentially will have involvement in contract management, including preparing, reviewing, negotiating, and approving relevant variation documents of Revenue Contracts. b. The process outlined here applies to all PW Global GeoMarkets Operations, both international and domestic excluding subordinate organization, Quail Tools. Exclusion may also apply to local ad-hoc or purchase order based agreements. c. GeoMarket global operations maintaining their local standards or procedures shall ensure such local standards or procedures are not in conflict with this process. d. All PW entities, except to the extent excluded in (b) above, shall become familiar with and adhere to this process. e. This process shall be considered and utilized in conjunction with BD.PRO.002 – Opportunity Management, CC.PRO.001 – Proposal Management and CC.PRO.002 – Contracting- Drilling & Well Services processes. 3. References: a. QM.POL.001 – Parker Wellbore Integrated Management System (IMS) Policy Statement b. QM.MAN.001 – Parker Wellbore Integrated Management System (IMS) Manual c. FN.STD.002.20 – Delegation of Authority d. LG.REF.001 - Contracts & Tender Responsibilities Matrix - PARIS 4. Definitions: None. 5. Overview: a. Contract Management process outlined here shall be utilized by the Contracts and Commercial Management (CCM) personnel and other Corporate and GeoMarket (GM) Support Functions personnel involved in contract management, including drafting, preparing, reviewing, negotiating and approving relevant variation documents of Revenue Contracts. b. For the purpose of this process, the term “variation documents” shall be used generically to describe the entire nomenclature of documents to introduce changes to the terms and conditions previously agreed and documented by the contracting parties. Thus, the term “variation documents” shall collectively include any amendments, addenda, change orders, modifications, revisions, and the like, to the existing Revenue Contracts. c. The process’s goal is to provide a standard approach to managing and amending Revenue Contracts as may be required due to operational needs during contract life cycle. d. Adherence to the process ensures the following:  Systemized approach in managing executed Revenue Contracts by GM’s Operations through minimizing the exposure to commercial and legal risks and preventing value leakage;  Adequate understanding of the contractual terms and conditions by individuals responsible for contract performance;  Compliance with contractual terms and conditions in the course of contract performance;  Identification of needs for change and timely engagement with various internal functions and customer throughout the change process; and  Handling and resolution of claims and disputes arising in the course of contract performance. e. The ultimate goals of this process are to ensure that:  Company’s inventory of revenue contracts is managed in accordance with company accepted practices;  GMs’ operational performance is in line with contractual requirements;  Customer’s expectations are continuously met or exceeded to allow PW either retain or expand its business;  Profitability is maintained at the levels projected during the price formulation and value deterioration is avoided;  Emerging needs for change are promptly identified and managed to accommodate new requirements evolving during contract performance; and  Value to PW is maximized through effective and efficient management of existing inventory of Revenue Contracts. 6. Roles & Responsibilities: In recognition of potential differences that may exist in the organizational structure at specific PW locations, roles and responsibilities for the specific process steps may vary; however, the sequence of steps and scope of responsibilities shall not be altered. Role Responsibility Executive Leadership Team (ELT)  As required, reviews and provides approval (or otherwise) for the proposed variation documents. GeoMarket Vice President (GM VP)  Provides overall supervision over the GM’s contractual strategy and performance under the Revenue Contracts it owns;  Liaises and engages with the customers to monitor their satisfaction with contractor’s performance and understand customers’ current or developing contractual needs;  Provides guidance, reviews and provides approval (or otherwise) for the proposed variation documents (as may be required);  Works with Support Functions to allocate necessary resources to be on or support Negotiating Team for the purpose of negotiating variation documents to the Revenue Contracts;  Together with Director CCM (re-)allocates corporate and GM resources to Negotiating Team as may be required. GeoMarket Business Development Director / Manager, Product Line / Operations Manager, Sales Representative (GM BD/Sales) 1  Maintains close interaction with the customer to monitor its overall satisfaction with performance under the GM’s Revenue Contracts;  Ensures early identification of any cases of dissatisfaction, discontentment, or disputes with the client and timeliness of remedial actions to address such situations;  When required, interfaces with the customer on contract change requests, originating either externally (customer’s requests) or internally;  Communicates with the customer in the course of negotiations of the variation documents to the Revenue Contracts;  Updates contract records in Salesforce accordingly. Director Contracts and Commercial Management (Director CCM), or designee  Acts as the owner of Contract Management process and PW’s established guidelines for contract and commercial management;  Provides overall supervision and support throughout the Contract Management process;  At request of GM VPs, (re-)allocates CCM resources as may be required to support GMs in their contract management activities;  As may be required evaluates/causes to be evaluated proposed drafts of the contractual documents and provides recommendations to mitigate PW’s liability and commercial risk exposure;  As may be required leads the negotiations or provides resources to negotiate variation documents to the Revenue Contracts or contract renewals. Contracts and Commercial Management assigned personnel (CCM personnel)  Review and evaluate proposed drafts of the contractual documents and provide recommendations to GM BD/Sales and GM CM to mitigate company liability and risk exposure;  Participate in negotiation of contract renewals or variation documents to contracts and provides support to GMs during such negotiations;  By engaging with Director CCM and Support Functions as necessary provide assistance and guidance to GMs on contractual related issues, including interpretation and application of contractual terms and conditions, contract deliverables. Negotiating Team  Involves Support Functions on as needed basis during negotiations of the variations documents;  Conducts negotiations with customer and keeps P&L Manager updated on the progress. GeoMarket Contracts Manager (GM CM) 2  Assists GM BD/Sales in organizing and conducting joint contract kick-off meeting with the customer (if planned);  Acts as a primary focal point for all activities and formal communications with the customer related to the contractual matters (except where such communications are routed through GM BD/Sales, or GM VP);  Interacts with the counterpart within the customer’s organization on resolving contractual issues arising in the course of performance of the Revenue Contract;  Continuously works with the P&L Manager and other stakeholders responsible for performance of the contract through raising awareness of contractual responsibilities, obligations and deliverables;  Actively participates in all activities associated with contract variation and drafts contractual documents as may be required;  Maintains contract documents repository on SharePoint, uploads new documents and updates them as needed;  Creates, maintains and updates contract entries in Salesforce;  Interfaces with auditing teams during contract audits, either internal or external (i.e. initiated by customer). Functional Area Departments (Support Functions)  As required, provide inputs, support and information throughout the Contract Management phase, including during negotiations of contract variation documents. P&L Manager 3  Acts as a focal point for interfacing with customer on operational issues during the performance of Revenue Contract;  Actively interacts with GM CM on all contract related issues and provides timely updates of any issues arising during contract performance;  Leads disputes resolution process;  Provides necessary support to GM CM, or his/her designate, during contract audits, either internal or external (i.e. initiated by customer);  Together with GM CM, conducts contract close-out activities. Notes: 1 In absence of dedicated GM BD/Sales, GM shall designate a person within the GM’s organizational structure responsible for performance of relevant duties and responsibilities. Sometimes, such responsibilities are assigned to Operations Manager or to General Manager. 2 In absence of dedicated GM CM, GM shall designate a person within the GM’s organizational structure responsible for performance of relevant duties and responsibilities of GM CM. Sometimes, such responsibilities are assigned to P&L Manager or to GM BD/Sales 3 This is to collectively refer to a manager with P&L authority for a specific organizational division within the GM (including General Managers, Location/Site Managers, Product Line/Operations Managers etc. as may be applicable), who is responsible for approvals in accordance with applicable Delegation of Authority standard. Contract Management Process Flow: a. Process Map: The following illustration provides the basic flow for the Contract Management process: Contract ManagementGeo Market P&L ManagerCCMGeo Market CMPhaseStart1. Handover of Executed Contract2. Joint Transition (Kick-Off) Meeting (Optional)3A. Dispute Resolution3B. Contract Audits3D. Contract Close-Out4. Post-Contract Customer Review & Lessons Learned 3C. Contract Variation (Sub-Process). Go to Section 8.End3. Contract Life Cycle Management b. Process Steps: The following table outlines the steps of the Contract Management process: Step No. Step Title Description 1 Start (Contract Handover) Pursuant to CC.PRO.002 Contracting- Drilling & Well Services process, P&L Manager and other GM and Divisional Operational and Finance personnel participate in a formal contract handover meeting conducted by the Negotiating Team. Note: CCM personnel or GM CM create a contract record in Salesforce for the new Revenue Contract. In addition GM CM, or individual assigned this responsibility, may develop a contract briefing document that summarizes essentials of the Revenue Contract, key contract clauses, responsibilities and obligations of the parties. Such contract briefing document may include actions and rationale behind some non-standard clauses, specific requirements, clarification of certain aspects of contract or project, layouts of the processes describing how changes will be managed and disputes will be handled and resolved. Although development of contract briefing document as a quick reference guide is a good contract management practice, this is an optional activity. 2 Joint Contract Kick-Off Meeting with Customer (Optional) As may be required, a joint contract kick-off meeting shall take place at the outset of operations under the new Revenue Contract engaging the participants from customer’s organization. Typically, these meetings are warranted by customers, but are generally considered to be a good contract and commercial management practice. A joint contract kick-off meeting will feature discussion of the same contractual highlights, which are covered during the internal handover of contract from the Negotiating team to GM’s Divisional Operational personnel, and engage personnel from both sides who had been actively involved in negotiation of the contract and going forward will be primarily responsible for its performance. Joint contract kick-off meetings may be helpful from the perspective of achieving better alignment with customer’s expectations and obtaining an understanding of customer’s priorities during the contract performance. If kick-off meeting takes place, notes capturing salient points of the meeting shall be prepared and posted in SharePoint and Salesforce. Note: Joint contract kick-off meetings are advisable, but are not mandatory. 3 Contract Life Cycle Management Both GM P&L Manager and GM CM shall continuously interact in any and all contract management tasks and activities. As P&L Manager is ultimately responsible for operational performance and financial results under a specific contract, he/she is formally responsible for day-to-day management of the Revenue Contract assigned to him/her. GM CM shall act as a primary facilitator for the contract management process and provide an oversight of all contractual matters related to a specific Revenue Contract. GM CM interfaces with:  Internal stakeholders on all issues pertinent to the Revenue Contract.  His/her counterparts within the customer’s organization on matters related to the contract management and contract variation. Day-to-day management of the Revenue Contract includes working with internal stakeholders on clarifications they may have with regard to application or interpretation of certain contractual terms, provisions or deliverables pertinent to their functions, timely preparation of reports required under such Revenue Contract, addressing any developing issues and", "1": "disputes, including disputed invoices, etc. Note: Activities associated with contract management are often diverse, but would typically include activities described in Steps 3A through 3D below. Additionally, Steps 3A, 3B and 3C may not necessarily be present in every contract, or happen in sequence provided in this document. Step 3D is always present and follows the others. 3A Dispute Resolution Any disputes with customer that may arise in the course of performance of the Revenue Contract shall be resolved in accordance with protocol set out in corresponding provisions of the contract applicable to dispute resolution. Every attempt shall be made to resolve a dispute in an amicable fashion and in the spirit of retaining good relations with the customer. Together with GM CM, P&L Manager shall be responsible for leading any dispute processes by engaging with Support Functions as required. 3B Contract Audits Revenue Contracts and related contract management activities may be audited both externally (i.e. during audits initiated by customer) and internally. Wherever the Revenue Contract provides for audit by customer, GM CM shall act as a primary focal point for interfacing with customer’s auditing team and shall be supported by Director CCM, or designee, Corporate CCM personnel and other Support Functions, as required. Internal contract audits may be initiated by Corporate CCM personnel and will be conducted pursuant to the internally established procedure. 3C Contract Variation (Sub-Process) A typical Revenue Contract may require certain variations over the contract life cycle. Note: For discrete steps and activities associated with contract variation, which shall be viewed as a sub-process of Contract Management process, please refer to Section 8. 3D Contract Close-Out During the contract close-out phase, P&L Manager shall ensure that all PW’s contract obligations have been fulfilled and customer has paid in full for the entire scope of work/services performed and there are no outstanding invoices. Conversely, any invoice issues have to be cleared or escalated to the attention of appropriate PW’s officer in accordance with GM’s divisional organization structure before the contract close-out. All surviving contract obligations (confidentiality, warranty, etc.) shall be completed and accounted for. 4 Post-Contract Customer Review & Lessons Learned Upon completion of the Revenue Contract, either due to termination or upon expiry of the contract term, GM BD/Sales shall conduct a formal close-out interview with customer to obtain customer’s feedback on contract/project experience. Salient points of customer’s feedback or minutes of meeting, if a formal exit meeting is held, shall be posted in Salesforce and SharePoint. Additionally GM CM and GM BD/Sales shall develop a summary of lessons learned from the contract performance and publish it in SharePoint. 5 End End of Process 7. Contract Variation Sub-Process Flow: a. Process Map: The following illustration provides the basic flow for the Contract Variation sub-process: Contract VariationP&L ManagerCCM (and/or GM BD/Sales, as needed)Negotiating TeamPhase1. Start2. Receive Request for Contract Variation3. Evaluate & Assess 4. Is the Requested Change Acceptable?5. Draft (Review) the Proposed Variation YES6. Revert to Customer8. NegotiateNO7. Accepted by Customer?14. Terminate Variation Process16 . End13. Close Out Contract Variation11. Execute Variation DocumentYESNO9. Agreement Reached?YES10. Continue Negotiations?NOYESNO12. Variation Document Distribution15. Contract Management Process b. Process Steps: The following table outlines the steps of the Contract Variation sub-process: Step No. Step Title Description 1 Start Over the life cycle of Revenue Contract, certain changes to contractual terms and conditions may become necessary. Variations may be either externally initiated (customer-requested changes) or internally initiated (changes requested by internal stakeholders). 2 Receive Request for Contract Variation GM CM or GM BD/Sales as per GM’s internal decision: Shall act as a focal point for collecting any requests for contract variation, initiated either externally or internally. Should any requests be received by GM Divisional Operational personnel, the requests shall be forwarded to GM CM or GM BD/Sales depending on who has been assigned by the GM to act as a focal point. 3 Evaluate & Assess Upon receipt of the request for contract variation, GM CM and/or GM BD/Sales shall engage with Support Functions, as required, to evaluate and assess the requested change. GM CM and GM BD/Sales shall keep GM P&L Manager updated on communications regarding the request. A requested variation may be due to:  Changing business environment or needs;  Organizational restructure within either customer’s or internal organization;  Changes to scope of work;  Changes in laws and regulations including changes in interpretation of laws and regulations;  Changes in regulatory requirements; or  Prerequisite terms and conditions of the contract (e.g. annual or event-based adjustments of contract compensation structure). A requested variation shall be evaluated and assessed from the perspective of its potential impact on program duration, contract term, changes in scope of work, and ultimately cost, and as a minimum reviewed by the following Support Functions:  GM/Corporate Operations;  GM/Corporate Finance;  GM/Corporate CCM; and  GM/Corporate Legal Department. Should the requested variation potentially have a material effect on commerciality of the Revenue Contract, profitability assumptions, or substantially alters or deviates from the risk profile of the Revenue Contract as previously assessed and approved, P&L Manager shall engage with GM VP for consultations and approval. Depending on materiality of the change and in accordance with applicable Delegation of Authority standard, GM VP may be required to escalate the assessment of requested variation to an appropriate organizational levels and receive approval(s) of the authorized officer(s). 4 Is the Requested Change Acceptable? Subject to completion of assessment of the change at appropriate organizational levels and contingent upon securing necessary approval(s) by the authorized officer(s) as described above in Step 3, GM P&L Manager shall determine if the requested change is acceptable.  If YES, go to Step 5  If NO, go to Step 14 5 Draft (or Review) the Proposed Variation When a request for variation comes from customer (originates externally) and a draft of the proposed variation to the Revenue Contract has been provided by the customer, GM CM must always initiate review of the proposed draft by GM/Corporate CCM and GM/Corporate Legal Department and engage Support Functions as required. GM CM shall document any counter-proposed changes or observations (if any) to the draft document and the rationale behind such. Conversely, when a request originates internally, GM CM shall draft a proposed variation document and circulate it for review by P&L Manager and Support Functions as may be necessary to obtain their input. GM CM shall modify the draft pursuant to the comments and observations provided by the P&L Manager and Support Functions in the course of such review. In the event variation increases risk exposure under the existing Revenue Contract, the proposed draft, or counter-draft, of the variation document, as the case may be, shall be reviewed at appropriate organizational levels and approved by the authorized officer(s) in accordance with applicable Delegation of Authority standard. 6 Revert to Customer GM CM formally communicates PW’s proposed draft, or counter-draft, of the variation document to the customer. GM CM shall make a record in Salesforce and post any relevant documents in SharePoint in the directory of the relevant Revenue Contract. Following the submission, GM CM, or GM BD/Sales (as necessary), shall remain in contact with the customer in case customer needs clarifications with regard to the essence of the proposed variation to the Revenue Contract. 7 Accepted by Customer? Is the variation document acceptable to the customer as submitted?  If YES, go to Step 11  If NO, go to Step 8 8 Negotiate If negotiation of the variation document is required, GM CM, or GM BD/Sales (as necessary), shall engage with P&L Manager and Support Functions or Negotiating Team to negotiate variation document. During negotiation of variation document, guidelines of Contracting Process shall apply and GM CM, GM BD/Sales, P&L Manager and other Support Functions shall be governed by the principles set forth in CC.PRO.002 – Contracting. 9 Agreement Reached? Has an agreement on variation to the Revenue Contract been reached?  If YES, go to Step 11  If NO, go to Step 10 10 Continue Negotiations? P&L Manager in consultations with GM CM, GM BD/Sales and other Support Functions or Negotiating Team, if established, determines whether or not to continue with negotiations.  If YES, go to Step 8  If NO, go to Step 14 11 Execute Variation Document GM CM jointly with the customer prepares the final version of the negotiated variation document for execution. GM CM shall distribute such version of the variation document to GM/Corporate CCM and GM/Corporate Legal Departments for final sign-off. Unless alternative signing sequence has been agreed with the customer, company officer (or designee) with a signing authority for contracting entity executes variation document, which is then co-executed by the customer’s authorized representative or his/her designee. GM CM or GM BD/Sales creates a record in Salesforce summarizing the introduced changes and providing the link to the SharePoint directory containing the executed document. 12 Variation Document Distribution GM CM:  Distributes executed variation document to P&L Manager and other GM and Divisional Operations and Finance personnel responsible for contract execution;  With the assistance of GM BD/Sales, engages with P&L Manager, GM and Divisional Operations and Finance as necessary to ensure understanding of the variation document (overview of the scope of work, roles and responsibilities, deliverables, etc.) 13 Close Out Contract Variation GM CM:  If executed in physical copies, obtains the original of the variation document and hands it over to the Legal Department repository for retention purposes;  Uploads executed variation document to SharePoint;  Updates contract record in Salesforce (including financials if changed) and makes additional records in Salesforce as necessary;  Go to Step 15 to continue contract management under CC.PRO.003 - Contract Management process. 14 Terminate Variation Process If a request for variation proves to be not viable, or an agreement on an intended variation cannot be reached, all further negotiations to that effect shall be ceased. GM CM shall inform the requestor of the change accordingly and record the highlights of walkaway position in Salesforce. Note: Shall inability to implement a contract variation present a circumstance of insuperable force for continuation of the Revenue Contract, the situation shall be resolved in accordance with the rights and remedies available under the Revenue Contract. 15 Contract Management Continue to manage amended Revenue Contract in accordance with Contract Management process. 16 End End of Process 8. Related Documents: a. BD.PRO.002 – Opportunity Management b. CC.PRO.001 – Proposal Management c. CC.PRO.002 – Contracting- Drilling & Well Services 9. Appendices: None 10. Forms: None 11. Revision History: Rev Date Author Approval Notes 3 02/14/2006 LR CD Issue date 08/01/2003. 4 10/13/2015 S. Buben M. Sanchez Substantially revised QP070503 Contract Amendment Procedure and replaced with BD.PRO.006 Contract Management –Drilling & Well Services Procedure 5 09/04/2019 S. Buben C. Cubeddu Revised to reflect new organizational structure, provide more inclusive definitions of functions and responsibilities, ensure stronger focus on Contract Handover Process and Contract Kick-Off Meeting and outline responsibilities during Contract Audit Process (TBD). 0 11/06/2020 S. Buben J. Simons Document transitioned to be aligned with Geo Market organizational structure and formation of CCM Department. The document control coding changed from BD.PRO.006 Contract Management Process to CC.PRO.003 Contract Management Process. 1 12/07/2022 E. Yevgrafov J. Lochridge Major process overhaul, including the revisions to eliminate obsolete steps and forms; streamline process flow; and update the document to reflect new PW brand.", "2": "1. Purpose: This document outlines and describes the contracting process for contracts with customers (Revenue Contracts) for Parker Wellbore (PW) global operations. 2. Scope: a. This document applies to all personnel who have or potentially will have involvement with preparing, reviewing, negotiating and approving Revenue Contracts awarded either as the result of previously submitted proposals (solicited or unsolicited) or direct negotiations with the customers. b. The process outlined here applies to all PW Global GeoMarkets Operations, both international and domestic excluding subordinate organization, Quail Tools. Exclusion may also apply to local ad-hoc or purchase order based agreements. c. GeoMarket global operations maintaining their local standards or procedures shall ensure such local standards or procedures are not in conflict with this process. d. All PW entities, except to the extent excluded in (b) above, shall become familiar with and adhere to this process. e. This process shall be considered and utilized in conjunction with BD.PRO.002 – Opportunity Management, CC.PRO.001 – Proposal Management and CC.PRO.003 – Contract Management processes. 3. References: a. QM.POL.001 – Parker Wellbore Integrated Management System (IMS) Policy Statement b. QM.MAN.001 – Parker Wellbore Integrated Management System (IMS) Manual c. FN.STD.002.20 – Delegation of Authority Standard d. LG.REF.001 - Contracts & Tender Responsibilities Matrix - PARIS 4. Definitions: None. 5. Overview: a. The Contracting process shall be utilized by the Contracts and Commercial Management (CCM) personnel and other Corporate and GeoMarket (GM) Support Functions personnel involved in drafting, preparing, reviewing, negotiating and approving Revenue Contracts. b. The process provides standard approach for developing, negotiating and approving Revenue Contracts. Adherence to the process ensures: proper involvement of the various company Support Functions in reviews and negotiations; transparency and traceability of decision making and approval process; proper transfer of the Revenue Contracts from negotiation phase into operations. The ultimate goals of this process are:  To ensure that company’s inventory of Revenue Contracts is aligned with corporate and GM’s strategies;  To assist GMs in reducing legal, operational and commercial risk exposure;  To improve the profitability of business and deliver value to all PW stakeholders. c. The process identifies the ultimate accountability and responsibility for the Contracting process steps. Within GMs, management may delegate the responsibilities for completion of individual steps or portions thereof in accordance with existing GM’s organizational and reporting structure and in strict compliance with the applicable Delegation of Authority standard; provided, however, that ultimate accountability and responsibility for completion of those individual steps or related portions remains with designated role specified in the process step. 6. Roles & Responsibilities: In recognition of potential differences that may exist in the organizational structure at specific PW locations, roles and responsibilities for the specific process steps may vary; however, the sequence of steps and scope of responsibilities shall not be altered. Role Responsibility Executive Leadership Team (ELT) As required:  Reviews negotiated Revenue Contract presented by GM and provides recommendations;  Provides approval (or otherwise) for entering into a Revenue Contract. Chief Operating Officer (COO) As required:  Reviews negotiated Revenue Contract presented by GMs and provides recommendations;  Provides approval (or otherwise) for entering into a Revenue Contract. Geomarket Vice President (GM VP)  Makes decision on entering into negotiations;  Together with Director CCM appoints the Negotiating Team;  Reviews CC.FOR.002 – Contract Assessment Approval Tool and provides guidance on risk tolerance;  Provides approval (or otherwise) for entering into a Revenue Contract. Director Contracts and Commercial Management (Director CCM), or designee  Acts as the owner of Contracting process and PW’s established guidelines for contracting;  Provides overall supervision, guidance and support throughout the process;  Together with GM VP appoints Negotiating Team;  As negotiations progress, together with GM VP determines if negotiated terms, conditions and commercial terms are acceptable. Contracts and Commercial Management assigned personnel (CCM personnel)  Communicate with the customer on Letter of Intent / Award and throughout Contracting process;  Coordinate the work of Negotiation Team;  Update records in Salesforce;  Create contract entry in Salesforce;  Organize and carry out the formal transfer of new Revenue Contract from Negotiating Team to GM & Division Operations. GeoMarket Business Development Director / Manager, Product Line / Operations Manager, Sales Representative (GM BD/Sales) 1  Works with CCM personnel throughout the process and is responsible for timely and accurately communicating any developments and progress during Contracting;  Liaise with the customer throughout Contracting process. Negotiating Team 2  Assesses the need for revision of commercial terms;  Conducts negotiations with customer, maintains negotiation records and keeps GM VP updated on the progress;  Involves Support Functions on as needed basis;  Uploads contract files into SharePoint and updates them as needed;  Creates and updates CC.FOR.002 – Contract Assessment Approval Tool (led jointly by CCM and Legal Functions);  Prepares final negotiated contract document;  Updates final bid sheet per the final negotiated terms. Functional Area Departments (Support Functions)  Provide inputs, support and information required for contract negotiation;  Review related sections of the contract as requested by Negotiating Team and provide recommendations;  Conduct final contract review (led jointly by CCM and Legal Functions). Profit & Loss Manager (P&L Manager) 3  Collaborates with CCM personnel and GM BD/Sales throughout the Contracting process.  Allocates resources within an organizational division of the GM as required to provide necessary inputs, support and information during Contracting process. Notes: 1 In absence of dedicated GM BD/Sales, GM shall designate a person within the GM’s organizational structure responsible for performance of relevant duties and responsibilities. Sometimes, such responsibilities are assigned to Operations Manager or to Country Manager. 2 Negotiating Team shall always include GM BD/Sales and assigned CCM personnel (Proposal Administrator) by default. 3 This term collectively refers to a manager with P&L authority for a specific organizational division within the GM (including General Managers, Location/Site Managers, Product Line/Operations Managers, etc. as may be applicable), who is responsible for approvals in accordance with applicable Delegation of Authority standard. 7. Contracting Process Flow: a. Process Map: The following illustration provides the basic flow for the Contracting process: Contracting Geo Market VP/SDCCM BD/SalesNegotiating Team / LegalPhase4. Terms & Conditions Acceptable?5. Notify Customer YESStartNO6. Negotiate?7. Initiate Amended Financial Analysis as Required3. Legal and Commercial ReviewNO6A. Appoint a Negotiating TeamYES6B. Notify Customer of Intent to Withdraw9. Negotiate Terms & Conditions8. Create Contract Assessment Approval Tool 10. Acceptable?11. Draft Contract CC.FOR.002YES12. Contract Acceptable?19. End ProcessGo To ProcessBD.PRO.006NO14. Approvals Secured? YESNO15. Final Contract ReviewYES10A. Continue?NOYESNO13. Additional Approvals Required?YESCC.FOR.0022. Terms & conditions known or pre-agreed?YESNO16. Execute Contract17. Close Out18. Contract HandoverNO b. Process Steps: The following table outlines the steps of the Contracting process: Step No. Step Title Description 1 Start GM VP (or GM BD/Sales) receives Letter of Intent / Award (or its equivalent) or invitation to direct negotiation. The Negotiating Team shall consult and align with LG.REF.001 - Contracts & Tender Responsibilities Matrix – PARIS when negotiating a Revenue Contract in accordance with this Process. 2 Terms & Conditions * Known or Pre-Agreed? Does the Letter of Intent / Award or invitation to negotiate have the contract terms and conditions, or are such terms and conditions known or pre-agreed?  If YES, go to Step 3  If NO, go to Step 6 Note: * In absence of contract terms and conditions, Parker Drilling’s standard contract terms and conditions shall be proposed. 3 Legal and Commercial Reviews GM VP (or GM BD/Sales) obtains input from GM/Corporate Legal and CCM personnel on the Letter of Intent / Award or equivalent as applicable or required to determine if terms and conditions are acceptable. Negotiating Team is encouraged to use MS Teams as much as possible as a collaborative space for contract reviews (redlines), working on the documents, spreadsheets, etc. which require input from multiple Support Functions; provided that the final soft and fully signed copies of the Revenue Contract are posted in SharePoint as set forth in Step 17. 4 Terms & Conditions Acceptable? Are stated customer’s terms and conditions acceptable without need to negotiate?  If YES, go to Step 5  If NO, go to Step 6 5 Notify Customer If acceptable, GM VP authorizes CCM personnel (or GM BD/Sales acting a focal point) to send the response to customer. CCM personnel (or GM BD/Sales) records the authorization and response to customer in Salesforce and posts any pertinent documents in SharePoint. Go to Step 11 6 Negotiate?  If YES, go to Step 6A (GM VP decides negotiation is required due to some stated customer’s terms and conditions not being acceptable, or PW’s standard contract terms and conditions have been proposed and customer wishes to negotiate).  If NO, go to Step 6B (GM VP decides* to forego further negotiation with customer (e.g. due to proposed customer’s terms and conditions not being acceptable and unlikely to be negotiable, or for other reasons). GM VP informs Sr. VP of Global Operations of the decision in writing and obtains consent to withdraw.) Note: *The decision to withdraw needs to take into consideration the conditions of the proposal and associated liabilities (i.e. bid bonds, guarantees, other forms of financial assurance) and has to be adequately documented. 6A Appoint a Negotiating Team GM VP and Director CCM appoint Negotiating Team consisting of GM & Corporate employees as may be required. Negotiating Team reports directly to GM VP and Director CCM. 6B Notify Customer of Intent to Withdraw CCM personnel (or MG BD/Sales) sends notice to customer of intent to withdraw, informs all internal stakeholders, and makes necessary records in Salesforce. Upon completion, go to Step 19. 7 Initiate Amended Financial Analysis As Required If parameters of commercial proposal* (including but not limited to profitability, EBITDA, revenue, CapEx and OpEx assumptions) have materially changed, GM VP initiates amended financial analysis for review at appropriate organizational levels and approval by the authorized officer(s) (as applicable). CCM personnel (or GM BD/Sales) makes appropriate entries in Salesforce to reflect any changes to the original proposal. Note: *In certain circumstances (e.g. negotiating Master Service Agreement (MSA) terms and conditions without making any specific commercial proposals to a customer), this step may not be required. 8 Create Contract Assessment Approval Tool It is recommended that Negotiating Team creates and begins to populate form CC.FOR.002 – Contract Assessment Approval Tool for the terms and conditions of the contract under consideration early in the process and continues to update it as negotiations progress. IMPORTANT: CC.FOR.002 – Contract Assessment Approval Tool MUST be completed at the time final draft contract is prepared for reviews and approvals as described in Step 11. 9 Negotiate Terms & Conditions Negotiating Team –  Negotiates terms, conditions and commercial terms as required;  Involves Support Functions and subject matter experts on as needed basis;  Keeps accurate record of the negotiation process and all agreed changes;  Keeps GM VP, Director CCM and P&L Manager continually informed of the negotiation progress. GM BD/Sales makes appropriate entries in Salesforce as to the progress of negotiations. 10 Acceptable? As negotiations progress, GM VP and Director CCM are briefed by the Negotiating Team and determine if negotiated terms, conditions and commercial terms are acceptable. GM VP (and Negotiating Team as required) will brief Sr. VP of Global Operations to obtain preliminary clearance for acceptance of certain terms, conditions and commercial terms that may require higher level of approval than GM VP.  If YES, go to Step 11  If NO, go to Step 10A 10A Continue? GM VP determines if contracting process shall continue.  If YES, go to Step 9  If NO, go to Step 6B 11 Draft Contract Negotiating Team – Prepares final draft contract once terms and conditions are deemed to have been agreed and acceptable to both parties. At this time, finalization of CC.FOR.002 – Contract Assessment Approval Tool based on the final draft contract is mandatory. CC.FOR.002 – Contract Assessment Approval Tool is available in IMS under CCM. Negotiating Team shall complete CC.FOR.002 – Contract Assessment Approval Tool in accordance with the", "3": "following criteria: Type “A” contracts: Drilling Master Services Agreement (MSA), drilling dayrate contract, O&M contract, Engineering Procurement Construction (EPC) contract, rig lease contract, or equivalent contracts. Always Type “B” contracts: Other than type “A” contracts, including, but not limited to: Consulting / engineering services contract, Front End Engineering and Design (FEED), concept development / detail design, offshore barge operations contracts, RAPID service, D3O, or equivalent contracts. If contract value AND risk exposure value exceed $500K 12 Contract Acceptable? GM VP reviews CC.FOR.002 – Contract Assessment Approval Tool to determine if the contractual terms and conditions are acceptable when and if required, by consulting Director CCM and Sr. VP of Global Operations. Decision is communicated in writing to Negotiating Team, and CCM personnel (or GM BD/Sales) records the decision in Salesforce.  If YES, go to Step 13  If NO, go to Step 6B 13 Additional Approvals Required? Are Additional Approval(s) Required? To the extent that negotiated terms and conditions of the final draft contract (per the finalized CC.FOR.002 – Contract Assessment Approval Tool) materially differ from the assumptions that supported the original proposal or result in significant changes to commercial model and/or legal and commercial liability exposure, such terms and conditions shall be reviewed at appropriate organizational levels and approved by the authorized officer(s).  If YES, go to Step 14  If NO, go to Step 15 14 Additional Approvals Secured? Depending on materiality of the changes as described in Step 13 above, GM VP supported by the members of Negotiating Team as required presents the negotiated draft contract to the authorized officer(s) and requests approval as per applicable Delegation of Authority standard. Authorized officer(s) review the details of the negotiated contract and communicate decision to GM VP. GM VP communicates the decision in writing to Negotiating Team. CCM personnel (or GMBD/Sales) records such decision in Salesforce.  If YES, go to Step 15  If NO, go to Step 6B 15 Final Contract Review Representatives of CCM and Legal functions jointly perform final review of the draft contract and confirm that its terms and conditions accurately capture the negotiated agreement between the parties. 16 Execute Contract Negotiating Team and authorized approving officer(s) endorse CC.FOR.002 – Contract Assessment Approval Tool, and PW’s officer (or designee) with a signing authority for contracting entity executes Revenue Contract. Note: For determining authorized PW’s officer with proper signing authority Negotiating Team shall contact Corporate Legal Department. 17 Close Out CCM personnel (or GM BD/Sales, or Designee):  Upload complete set of executed contractual documents to SharePoint. If the final soft and fully signed copies of the Revenue Contract are posted in MS Teams, at this time such documents must be posted in SharePoint and a link shall be included in the contract record in Salesforce;  Obtain the original hardcopy of the Revenue Contract (if executed in physical copies) and hand it over to Legal Department repository;  Create and activate contract entry in Salesforce;  Update the final commercial model (bid sheet) per the negotiated terms; and  Provide a copy of executed contract to P&L Manager and other GM and Divisional Operational and Finance personnel. 18 Contract Handover Negotiating Team organizes and carries out a formal handover of the negotiated and executed Revenue Contract to the P&L Manager and other GM and Divisional Operational personnel. Note: Negotiating Team shall not be required to carry out formal handover of Revenue Contracts for offshore barge operations due to relative brevity of offshore projects in the U.S. Gulf of Mexico and predominant use of PW’s model contract forms, except when a formal contract handover is requested by the P&L Manager (i.e. longer duration drilling campaigns, non-standard contract terms, etc.). This step shall be led by GMBD/Sales and CCM assigned personnel. Handing over shall include the contract overview with identification of main risks, obligations and responsibilities. Aspects to be addressed during the handover shall as a minimum include the following:  Objectives and scope of work  Key contract terms and conditions  Non-standard risks and liabilities  Roles and responsibilities of the parties  Contract deliverables  Timescales and milestones  Interfaces and level of authority  Reporting requirements  Disputes and dispute resolution mechanism  Recourse and penalties  Invoicing and payment terms and provisions General outline of the Contract Handover Presentation (CC.TEM.003) is available in IMS under CCM. Upon conclusion of the contract handover meeting CCM personnel (or GM BD/Sales) make appropriate entry in Salesforce, listing the participants of the meeting and uploading a copy of Contract Handover Presentation to the appropriate folder in SharePoint. Note: Thereafter, P&L Manager responsible for the management of the Revenue Contract may elect to conduct refresher presentations on as needed basis to reinforce understanding of the contractual terms by the Division’s Operational personnel or in the events of significant changes in key Division’s Operational personnel’s positions. 19 End End of Contracting Process 8. Related Documents: a. BD.PRO.002 – Opportunity Management b. CC.PRO.001 – Proposal Management c. CC.PRO.003 – Contract Management d. FN.STD.002.20 – Delegation of Authority 9. Appendices: None 10. Forms: a. CC.FOR.002 – Contract Assessment Approval Tool b. CC.TEM.003 – Contract Handover Presentation 11. Revision History: Rev Date Author Approval Notes 4 02/21/2007 LR CD Issue date 08/01/2003. 5 MM/DD/YYYY S. Buben M. Sanchez Substantially revised QP07501 Contract Tender Process International Operations. 6 Mm/dd/2018 S. Buben C. Cubeddu Revision 6 of BD.PRO.004 – Contracting Process 0 11/06/2020 S. Buben J. Simons Document transitioned to be aligned with Geo Market organizational structure and formation of CCM Department. The document control revised with the new functional code CC from previously BD functional process BD.PRO.004 Contracting Process to CC.PRO. 002 Contracting-Drilling and Well Services Process. 1 12/07/2022 E. Yevgrafov J. Lochridge Major process overhaul, including the revisions to eliminate obsolete steps and forms; streamline process flow; and update the document to reflect new PW brand.", "4": "1. Purpose: This document outlines the process for New Market Entry (NME). The NME process governs the scope, responsibilities and requirements for conducting due diligence activities in order to determine feasibility of establishing and maintaining operations in support of business opportunities in new markets that are aligned with Parker Wellbore (PW) corporate long-term business development strategy and expansion into new markets, in which PW is not presently operational. 2. Scope: a. This process applies to all Corporate and Geomarket (GM) personnel who are involved in due diligence activities for managing business opportunities in new market environments. b. The NME process applies to all GMs with either international or domestic operations, which consider pursuing business opportunities, which require NME. c. All Corporate and GM personnel shall become familiar with and adhere to this process. d. This process may be considered and utilized in conjunction with BD.PRO.002 – Opportunity Management and CC.PRO.001 – Proposal Management process. 3. References: a. BD.PRO.002 – Opportunity Management b. CC.PRO.001 – Proposal Management c. FN.STD.002.20 – Delegation of Authority (DOA) 4. Overview: a. The NME process is designed to support the scope of activities conducted by the GM and Corporate designated personnel in pursuance of business opportunities, which require NME. This includes initial assessment of new markets and business case development, and, if pre-approved by the Executive Leadership Tem (ELT), followed by the fact-gathering, or due diligence work on a new market under consideration, so that the associated business opportunities are holistically assessed and developed, and GM and Corporate personnel have adequate and sufficient data about new market in order to present key findings to the ELT, who will then jointly authorize or otherwise reject authorization for NME. b. The underlying purpose of the NME process is to organize and coordinate fact-gathering work about a specific new market as defined in Section 5 below, including general overview of the market and its competition and pricing, analysis of operating costs, etc. and if this entails establishing a permanent presence in a new country, where PW is not currently operational, then also a comprehensive study of the new country, including collection of key social, political and economic data, i.e. geographical location, political regime, legislation, judicial and fiscal systems, taxation regime, import and export regulations, availability and costing of goods and services, etc. This fact-gathering and investigative activities are collectively referred to as Due Diligence (DD). c. DD is a critical element of NME process intended to provide sufficient proxy data about anticipated market- and country-specific operating conditions and costs in support of business opportunities pursued in the new market environments. In absence of in-house data about such markets or country-specific operating conditions and costs, it allows the GM and ELT to make educated decisions and drives the decision-making process by ensuring proper understanding of social, political and economic risks associated with a NME and preemptively identifying ways to mitigate such risks. 5. Requirements: For the purpose of this process, the term “new market” may include one or combination of the following: a. New market = new service or product: PW is willing to offer a new, additional service or product in a country with the established presence where PW currently offers certain of its services or products; b. New market = new country of operations: 1,2 PW is willing to enter a new country of operations to offer certain of its services or products (either with or without establishing permanent presence in the new country of operations). Notes: 1 New country of operations can be either (i) a sovereign state or (ii) a region within a sovereign state with largely recognized special administrative status or autonomy (e.g. Kurdistan Region of Iraq, Hong Kong Special Administrative Region of the People's Republic of China, etc.); 2 New country of operations can be either (i) a new country/region in which PW has never operated historically or (ii) a country/region where PW has not been operational in the past two (2) years or where material economic/political changes have occurred since last operation/DD campaign. Based on the above definitions of new markets, the process and scope of DD activities can be generally organized in the following tiers: Tiers of DD for NME campaigns Tiers Inputs Tier 1 Examples: PW is already established in the country of operations and provides certain services or/and products, but wishes to expand the suite of services/products Tier 2 Examples: Drilling: Project/engineering services, consulting, training, dry lease opportunities, etc.) Rental: Single sales transactions, rentals with no direct operations, etc.) Tier 3 Examples: Drilling: O&M services, drilling services with PW’s rig(s) in country Rental: Machine shop services, TRS, rentals with direct operations, etc.) Current established presence? Yes No No Certain services and products currently offered? Yes No No Want to offer… An additional service or product (not currently provided) A service or/and product that does not require establishing permanent presence A service or product that requires establishing permanent presence Process & scope of DD activities Pre-DD ELT Opportunity Review Form ELT Opportunity Review Form ELT Opportunity Review Form DD DD Checklist (Questionnaire) – Section XVI ONLY - Operational considerations and costing info + Partner considerations (as required) Full DD Checklist (Questionnaire) + Partner considerations (as required) + In-country location visit (as required) Full DD Checklist (Questionnaire) + Partner considerations (as required) + In-country location visit (as required) 6. Deliverables: The expected deliverables for the NME process include: a. BD.FOR.003 – ELT Opportunity Review Form; b. CC.FOR.003 - DD Checklist (Questionnaire): 1) Only completed Section XVI – Operational considerations and costing information for Tier 1 DD; or 2) Full completed DD Checklist (Questionnaire) for Tiers 2 & 3 DD. c. ELT DD Findings Summary Presentation, a slide deck developed based on the completed DD Checklist (Questionnaire) per the above, containing key DD findings, ‘red flags’, risks and mitigation techniques and general recommendation about the NME. Note: In the course of DD process, GM shall maintain the commercial model (bid sheet) for a business opportunity under consideration and update it accordingly by incorporating any DD findings that may have commercial impact. 7. Roles & Responsibilities: Role Responsibility Executive Leadership Team (ELT)  Reviews the initial ELT Opportunity Review Form prepared by the GM and grants authority or withholds authorization to GM to proceed with business opportunity requiring NME.  Approves or withholds authorization for NME upon review of DD Findings Presentation developed by the DD Team upon the completion of DD campaign. Role Responsibility Director, Contracts and Commercial Management (Director CCM) or assignee  Owns CC.PRO.004 - New Market Entry process.  Provides guidance and support, as necessary, to GM BD/Sales personnel in planning, executing and reporting DD activities.  In cooperation with GM VP determines the required competencies and makeup of the DD Team.  Provides direction and support, as necessary, to DD Team as they execute DD campaign.  Provides quality assurance of the DD activities and reporting.  Coordinates all administrative requirements associated with the DD process, including requests for external support, logistics, administrative needs, and other requirements.  Coordinates detailed task lists to DD Team members upon assembly.  Coordinates specific deadlines for completion of DD activities, including location visits, and other tasks to be conducted by DD Team.  Facilitates completion of the DD Checklist (Questionnaire) by various DD Team members.  Owns and controls master copy of the DD Checklist (Questionnaire) in DD repository on SharePoint or MS Team location and ensures timely updates of such. Geomarket Vice-President (GM VP)  Provides clear guidance to GM BD/Sales personnel on market opportunities in identified strategic new markets.  In cooperation with Sr. Vice President, Global BD (Sr. VP Global BD) identifies opportunities that should be subject to DD process.  Provides internal GM support, as necessary, to facilitate execution of DD activities.  Provides GM funding and other resources, as necessary, for DD activities securing necessary approvals consistent with delegation of authority policy.  Reviews and assesses the DD findings, approves the ELT DD Findings Summary Presentation and makes final recommendation to the ELT. Geomarkets Business Development Director / Manager, Product Line / Operations Manager, Sales Representative (GM BD/ Sales) 1  Is responsible for DD activities within the GM.  Represents GM on the DD Team for all DD activities related to GM.  Together with other DD Team members prepares the ELT DD Findings Summary Presentation and submits the same to GM VP for review.  Schedules and conducts formal ELT DD Findings Summary Presentation meeting for the ELT.  Assists GM VP in preparation and presentation of the final recommendation to the ELT. Due Diligence Team (DD Team)  Completes detailed research on assigned DD project, to ensure adequate information is delivered to allow most informed decision by the GM VP and the ELT.  Participates in location visits, as directed, to validate assumptions and/or complete research on assigned DD project. Functional Area Departments (Support Functions)  If requested by CCM or GM BD/Sales, provide input for completion of ELT Opportunity Review Form.  Designate representatives for the DD Team.  Provide support as required during the NME execution once approved. Notes: 1 In absence of dedicated GM BD/Sales, GM shall designate a person within the GM’s organizational structure responsible for performance of relevant duties and responsibilities. Sometimes, such responsibilities are assigned to Operations Manager or to Country Manager. 8. Process Flow: Process Map: The following illustration provides the basic flow for the NME process: NEW MARKET ENTRY – DUE DILIGENCEGM BD/SALES/ CCMDUE DILIGENCETEAM (DDT)GM Vice President / Senior DirectorELTCLOSEOUTPRE-DUE DILIGENCEDUE DILIGENCEREVIEW AND APPROVAL1. START2. IS DD REQUIRED?3. COMPLETE ELT OPPORTUNITY REVIEW FORMYES4. PRESENT PRE-DD FINDINGS TOGM VP 6. INITIATE DUE DILIGENCE7. DEFINE SCOPE OF DUE DILIGENCE8. IDENTIFY AND ASSEMBLE DD TEAM 9. CONDUCT DUE DILIGENCE KICK-OFF MEETING10. COMPLETE CC.FOR.003 – DD CHECKLISTCC.FOR.00311. LOCATION VISIT(S) REQUIRED?YES13. AUTHORIZE IN-COUNTRY LOCATION VISIT(S)15. REVIEW & FINALIZE CC.FOR.003 CHECKLISTYES17. DEVELOP ELT DD SUMMARY PRESENTATIONCC.FOR.00316. PARTNER CONSIDERATIONS (OPTIONAL)20. NEW MARKET ENTRY AUTHORIZED?21.EXECUTE NME22. POST-ENTRY EVALUATION (OPTIONAL)YES23. ENDNONO19. CONDUCT DUE DILIGENCE REVIEW WITH ELT14. CONDUCT IN-COUNTRY VISIT(S)18. APPROVE DD FINDINGS?YES5. PRESENT PRE-DD FINDINGS TO ELT12. DETERMINE SCOPE OF IN-COUNTRY VISITSNOBD.FOR.0035B. RECYCLE?YES5A. AUTHORIZE DD?NOYESNO Process Steps: The following table outlines the steps of the NME process: Step No. Step Title Description 1 Start DD process for a NME may be initiated upon direction from GM VP in conjunction with either BD.PRO.002 – Opportunity Management or CC.PRO.001 – Proposal Management processes in the event a business opportunity pursued by the GM requires a NME. 2 Initiate Request for Due Diligence? In cooperation with Sr. VP Global BD, GM VP determines whether:  A new market and associated opportunities fit PW’s global and GM’s regional development strategy?  GM and PW have the resources to support the NME? Based on the criteria stated in Section 5 “Requirements” of this process, GM VP decides if DD should be initiated for the business opportunity under consideration. The decision should identify an appropriate tier of DD.  IF YES, go to Step 3  IF NO, go to Step 23 3 Complete ELT Opportunity Review Form Following the guidance from the GM VP, GM BD/Sales completes BD.FOR.003 - ELT Opportunity Review Form. This form is designed to capture key details of a business opportunity requiring NME, including:  General market overview  Strategic alignment  Summary of opportunities  Clients and competition  Intel on competition pricing  Major known risks and ‘red flags’  Investment requirements, including estimate of PW out-of-pocket costs If required, GM BD/Sales may request input from Support Functions to complete this form. Completion of this step represents pre-DD activities. Step No. Step Title Description 4 Present Pre-DD Findings (completed ELT Opportunity Review Form) to GM VP GM BD/Sales presents completed BD.FOR.003 - ELT Opportunity Review Form to GM VP. GM VP reviews ELT Opportunity Review Form and makes one of the following decisions:  PROCEED, Go to Step 5  Pre-DD findings are inconsistent or missing key data - REVISE/RESUBMIT, Go to Step 3  Pre-DD findings indicate considerable concerns and ‘no-go’", "5": "factors - ABORT, Go to Step 23 Note: If DD is aborted, GM VP briefs Sr. VP Global BD on the reasons and causes GM BD/Sales record the decision and post completed ELT Opportunity Review Form in SharePoint. 5 Present Pre-DD Findings (completed ELT Opportunity Review Form) to the ELT GM BD/Sales organizes a meeting with GM VP, Director CCM and the ELT to review ELT Opportunity Review Form. The ELT reviews the form and jointly makes one of the following decisions: 5A Authorize DD?  AUTHORIZE DD, Go to Step 6 Note: If DD is authorized, GM BD/Sales records the decision and posts completed ELT Opportunity Review Form in SharePoint. At this time, the ELT may re-assign the tier of DD and/or provide recommendations and particular area of focus for the DD team to research during the DD campaign, which shall be noted on the form. 5B Recycle?  Pre-DD findings are inconsistent or missing key data - REVISE/RESUBMIT, Go to Step 3 OR  Pre-DD findings indicate considerable concerns and ‘no-go’ factors - ABORT, Go to Step 23 Note: If DD is aborted, GM BD/Sales records the decision and posts completed ELT Opportunity Review Form in SharePoint. Step No. Step Title Description 6 Initiate DD Upon securing authorization from the ELT, GM VP and GM BD/Sales engage with Director CCM and designated GM CCM personnel to define the scope of DD, assemble the DD Team and initiate the DD campaign. 7 Define Scope of DD Based on the nature of the opportunity, specific market, previous experience, existing information, and ELT’s recommendations, GM BD/Sales and designated GM CCM personnel define and prioritize the scope of the required DD activities. To do that, GM BD/Sales and GM CCM personnel shall review the appropriate sections within the CC.FOR.003 - DD Checklist (Questionnaire), which need to be completed for the purpose of specific DD campaign in accordance with the designated tier and assign priority ranking for each item on the form and a due date by which such item needs to be investigated and reported on. The priority ranking may be as follows:  “High Priority”: Any items, which may be critical or essential for understanding to make a decision about NME. These items include any showstoppers or major barriers to NME, or represent risks that can’t be managed or are impossible to mitigate;  “Medium Priority”: Any items, which are essential for understating of the requirements for establishing/conducting operations, contract negotiations, etc. Include any issues/risks that PW needs to understand prior to signature of the contract and to mitigate accordingly in terms and conditions or planned entity structure;  “Low Priority”: The remainder of the items required for operations management, planning and execution to achieve desired project results, etc. Step No. Step Title Description 8 Identify and Assemble DD Team Depending on the defined scope of DD activities, a specific DD campaign may require involvement of both Corporate and GM resources, as well as local or global third parties or combination thereof. Typically, the DD Team shall include representatives from the following Support Functions, both GM- and Corporate-based, depending on specific requirements, availability and other considerations:  Business Development (BD);  Contracts and Commercial Management (CCM);  Operations;  Finance;  Tax;  Legal;  Compliance;  Human Resources (HR);  Supply Chain Management (SCM); and  Technical Services (TS). Depending on the scope and nature of the DD campaign, representatives of other Support Functions may be added to the DD Team in the course of DD campaign as required. Based on the defined scope of DD activities, GM BD/Sales and GM CCM personnel shall reach out to the Support Functions to identify the individuals who will represent their respective functions on the DD Team, including both Corporate and GM personnel. Once all the DD Team members have been identified, GM BD/Sales and GM CCM personnel shall send a formal email to all identified members of the DD Team to confirm their participation. DD Team Leader(s) may be appointed at this time; in the absence of formally appointed DD Team Leader the responsibility shall be shared by GM BD/Sales and GM CCM personnel. Step No. Step Title Description 9 Conduct DD Kick-Off Meeting GM BD/Sales and GM CCM personnel initiate a kick-off meeting with the DD Team. GM BD/Sales and GM CCM personnel present the details of the opportunity or evaluated market to the DD Team members along with all available information that may be pertinent to the DD campaign. Prior to the kick-off meeting GM BD/Sales and GM CCM personnel prepare and distribute among the DD Team members any presentation materials and the initial draft of the CC.FOR.003 - DD Checklist (Questionnaire) identifying the scope of DD and responsible DD Team members. The DD Team members shall review the initial draft of the CC.FOR.003 - DD Checklist (Questionnaire) and if they disagree with the specified due dates and/or assigned priority rankings, they should report to GM BD/Sales and GM CCM personnel as soon as practical. To optimize logistics of the DD process, GM BD/Sales and GM CCM personnel may set up a dedicated shared-access site and document repository accessible by all DD Team members in MS Teams. GM Finance Controller sets up a project cost center to track all NME related costs. 10 Complete CC.FOR.003 - DD Checklist (Questionnaire) The DD Team members shall complete the assigned sections of the CC.FOR.003 - DD Checklist (Questionnaire) by the specified due dates and in accordance with the assigned priority rankings. If the CC.FOR.003 - DD Checklist (Questionnaire) is not stored in a dedicated shared-access site and document repository accessible by all DD Team members in MS Teams, GM BD/Sales and GM CCM personnel shall be responsible for maintaining the master copy of the CC.FOR.003 - DD Checklist (Questionnaire) and update it with the inputs received from the DD Team members. GM BD/Sales and GM CCM personnel shall coordinate work of the DD Team and continuously monitor DD progress. 11 In-Country Location Visit(s) Required? An in-country location visit may be required in accordance with the criteria stated in Section 5 “Requirements” of this process in order to gain additional information that may only be collected on the ground or to validate any of the DD findings collected by the DD Team. Is an in-country location visit required?  IF YES, Go to Step 12  IF NO, Go to Step 15 Step No. Step Title Description 12 Determine Scope of In-Country Location Visit(s) With the guidance from GM VP, GM BD/Sales and GM CCM personnel develop a brief summary of the scope of in-country DD activities, including the following:  Members of the DD Team or other participants;  Expected duration;  Specific tasks to be completed during the in-country location visit by each participant;  Specific sites to be visited; and  Necessary authorizations for expenditure associated with the location visit as applicable. 13 Authorize In-Country Location Visit(s) GM VP shall engage with Director CCM and the ELT to determine whether an in-country location visit shall be authorized. Unless expressly agreed otherwise, GM VP is responsible for allocating funding and other resources, as necessary, required for in-country location visit(s), including securing necessary approvals consistent with delegation of authority policy.  IF YES, Go to Step 14  IF NO, Go to Step 15 14 Conduct In-Country Location Visit(s) and Collate Additional Input Into CC.FOR.003 - DD Checklist (Questionnaire) Assigned participants and/or members of DD Team conduct in-country location visit(s), meet with specified third parties (as applicable), collect required information and complete other assigned tasks. DD Team members record their findings and update CC.FOR.003 - DD Checklist (Questionnaire) or otherwise report their findings to GM BD/Sales and GM CE personnel to update master copy of the CC.FOR.003 - DD Checklist (Questionnaire), if not stored in a dedicated shared-access site and document repository accessible by all DD Team members. 15 Review & Finalize CC.FOR.003 - DD Checklist (Questionnaire) Upon completion of the CC.FOR.003 - DD Checklist (Questionnaire), GM BD/Sales and GM CCM personnel requests the DD Team members to conduct their final review and validation of information contained therein. DD Team members provide their comments, observations, and updates/edits to the CC.FOR.003 - DD Checklist (Questionnaire). Step No. Step Title Description 16 Partner Considerations (Optional) In the course of DD campaign, GM may be learning that in certain new markets a decision about what type of operating entity should be established may be subject to a number of partner considerations (e.g. government-warranted local partnership requirements, or partnering with a local companies to gain access to the established infrastructure and thus, secure an additional competitive advantage, etc.). If so, such partner considerations should be researched by the members of DD Team, including Operations, Legal/Compliance and Tax, and taken into account in regards to the DD Team’s recommendation on the type of operating entity. 17 Develop ELT DD Findings Summary Presentation GM BD/Sales and GM CCM personnel conduct final interviews with the DD Team members to identify key findings and obtain general recommendation from the perspective of each business function as to whether they recommend NME or not. Based on the completed CC.FOR.003 - DD Checklist (Questionnaire) and consultations with the DD Team members during the interviews, GM BD/Sales and GM CCM personnel develop the ELT DD Findings Summary Presentation. There is no prescribed format for the presentation, but it should be limited to 5-6 slides and provide sufficient details about the completed DD, including as follows:  Brief overview of the NME opportunities;  Scope and methodology (e.g. timelines, scope of research, sourced used);  Overall recommendation about NME taking into account input from each function;  Major challenges and concerns, “red flags” and mitigation strategy and techniques;  Considerations and things to look for. 18 Approve CC.FOR.003 - DD Checklist (Questionnaire) and ELT DD Findings Summary Presentation The GM VP reviews CC.FOR.003 - DD Checklist (Questionnaire) and ELT DD Findings Summary Presentation with the DD Team. Are the DD findings approved?  IF YES, Go to Step 19  IF NO, DD Team, as applicable, shall conduct additional research and clarify missing or inconsistent data and CC.FOR.003 - DD Checklist (Questionnaire) and/or ELT DD Findings Summary Presentation shall be updated accordingly. Step No. Step Title Description 19 Conduct DD Findings Review with the ELT GM BD/Sales and GM CCM personnel organizes a meeting with the ELT to review the DD findings. All DD Team members shall be present at the meeting to clarify any aspects of the DD findings, if necessary. The ELT may request further research or additional scope of DD activities on any presented DD findings, as they deem necessary. 20 NME Authorized? Upon the review of the DD findings and recommendation from the DD Team, the ELT and DD Team may re-convene to review and discuss any new findings or clarifications from the additional scope of DD activities if requested by the ELT. Is the NME authorized by the ELT?  IF YES, Go to Step 21  IF NO, Go to Step 23 21 Execute NME Once GM obtains permission to perform the NME, GM shall develop the execution plan taking into consideration DD findings and recommendations and risk mitigation techniques identified during the DD process. GM VP (or a designate) shall coordinate with the Support Functions on as needed basis to ensure adequate support is provided during the NME execution. GM VP shall keep the ELT informed of the status of the NME execution process. 22 Post-Entry Evaluation (Optional) Director CCM together with GM VP may conduct an evaluation of the NME following at least six (6) months from the commencement of operations. During this process, GM VP shall provide feedback on the effectiveness of the DD work done by the DD Team, including any DD findings that were validated and any gaps in the DD identified during the execution phase based on the results of the initial period of operations. 23 End End Process 9. Related Documents: a. BD.PRO.002", "6": "– Opportunity Management b. CC.PRO.001 – Proposal Management c. FN.STD.002.20 – Delegation of Authority 10. Forms: a. BD.FOR.003 – ELT Opportunity Review Form b. CC.FOR.003 – Due Diligence Checklist (Questionnaire) 11. Revision History: Rev Date Author Approval Notes 0 12/22/2015 S. Buben D. Farmer New Procedure 1 11/28/2016 S. Buben C. Cubeddu Included form reference to Section 12 (BD.FOR.008 – Due Diligence Checklist) and added to Appendix A. 2 12/07/2022 Y. Yevgrafov J. Lochridge Major process overhaul, including the revisions to eliminate obsolete steps and forms; streamline process flow; and update the document to reflect new PW brand.", "7": "1. Purpose: This document outlines the process of Proposal Management. The process governs activities related to development and management of proposals for Parker Wellbore (PW) operations, prepared by PW for external customers (hereinafter referred to as “Proposals”). 2. Scope: a. This document applies to all Corporate and GeoMarket (GM) personnel who are or potentially may be involved in preparing, reviewing, and approving Proposals (both solicited and unsolicited). b. The Proposal Management process applies to all GMs of both international and domestic operations except for Quail Tools, Well Construction, Well Intervention and Surface & Tubular service lines. For the sake of clarity, the process applies to all Owned Drilling, Dry Lease, O&M and rig related opportunities c. This process shall be considered and utilized in conjunction with BD.PRO.002 – Opportunity Management and CC.PRO.002 – Contracting processes. 3. References: a. QM.POL.001 – Integrated Management System (IMS) Policy Statement b. QM.MAN.001 – Integrated Management System (IMS) Manual c. FN.STD.002.20 – Delegation of Authority (DOA) d. LG.REF.001 – Contracts & Tender Responsibilities Matrix - PARIS 4. Overview: a. Proposals defined in this process include: 1) Solicited Proposals (Invitation to Tender (ITT), Request for Proposal (RFP), and Request for Quotation (RFQ), Pre-Qualification (PQF), Solicitations of Interest (SOI), Expression of Interest (EOI), and Inquiry (INQ), etc.) (provided however, that PQFs, SOIs, EOIs, etc. NOT requiring commercial proposal or binding commitment from PW, shall not be subject to the reviews and approvals required in accordance with Steps 10 through 14 of this Process) 2) Unsolicited / Direct Negotiation Proposals. b. The Contracts and Commercial Management Department (CCM) personnel, GM personnel and other Support Functions involved in the preparation of Proposals, for existing or potential customers shall utilize Proposal Management process outlined here. c. The process is developed with the goal of providing a standard approach for preparing Proposals to customers. Adherence to the process ensures proper involvement of the various PW functions in reviews and development of Proposals; transparency and traceability of decision making and approval process; completeness of the document package and accuracy of the records. The ultimate goal is to ensure that PW Proposals are developed at the highest quality level, are aligned with corporate and GMs’ strategies for achieving sustainable commercial results, assist in positioning PW with emphasis on commitment to deliver innovative, reliable and efficient performance for its customers and increase chances for obtaining new business and retention of existing business. d. The process identifies the ultimate accountability and responsibility for the Proposal Management process steps. Within GMs, management may delegate the responsibilities for completion of individual steps or portions thereof in accordance with existing GM’s organizational and reporting structure and in strict compliance with the applicable Delegation of Authority standard. However, the ultimate accountability and responsibility for completion of those individual steps or portions thereof remains with designated role or an individual in that role or function specified in the process step. 5. Roles & Responsibilities1: Role Responsibility Executive Leadership Team (ELT) As required:  Reviews Proposal presented by GM;  Provides recommendations;  Provides approval (or otherwise) for submission of Proposal. Peer Review Team (PRT)  Reviews Proposal presented by GM;  Provides recommendations. Senior Vice President of Global Operations (COO) As required:  Reviews Proposal presented by GM;  Provides recommendations;  Provides approval (or otherwise) for submission of Proposal;  Provides approval for post-submission changes to the submitted Proposal. GeoMarket Vice-President (GM VP)  Provides approval for Proposal preparation;  Reviews Proposal presented by GM;  Reviews recommendations provided during the Peer Review and by the ELT;  Provides final approval (or otherwise) for submission of Proposal - within the limits of applicable Delegation of Authority standard;  Provides approval for post-submission changes to the submitted Proposal, within the limits of applicable Delegation of Authority standard. Director Contracts and Commercial Management (Director CCM), or designee  Provides overall supervision, guidance and support throughout the process;  (Re-) allocates corporate CCM resources to Proposal Team as may be required;  Leads the review and analysis of customer requests for proposals, with balanced focus on risk tolerance and profitability;  Participates in ELT Reviews. Contracts and Commercial Management assigned personnel (CCM personnel)  Manage and coordinates Proposal preparation process;  Work in close coordination with GM BD/Sales;  Ensure adherence to Proposal Management Process, quality standards and relevant deadlines;  Responsible for preparation and/or review and analysis of contractual terms and conditions associated with Proposal;  Assist GM BD/Sales in organizing and scheduling Peer Review and ELT Review. GeoMarkets Business Development Director / Manager, Product Line / Operations Manager, Sales Representative (GM BD) 2  Assesses customer’s project requirements as applicable;  Acts as a focal point for communications with the customer in the course of proposal preparation of Proposals unless this responsibility is assigned to CCM personnel;  Works cooperatively with CCM assigned personnel as a member of Proposal Team;  Organizes and schedules Peer Review and ELT Reviews  Presents at Peer Review and ELT Review with GM;  Updates records in Salesforce. Proposal Team  Assesses and reviews customer’s project or tender request documents;  Communicates internally with Support Functions in the process of Proposal preparation;  Prepares Proposal package;  Participates in Peer Review as may be requested by GM BD. Functional Area Departments (Support Functions)  Assess and review project or tender request documents;  Provide inputs, support and information required for preparation of the relative sections of Proposal;  Review relative sections of the Proposal package;  Participate in Peer Review as may be requested by GM BD and in ELT Review as necessary. Profit & Loss Manager (P&L Manager)3  Collaborates with GM BD on Proposal preparation;  Allocates resources within an organizational division of the GM as required to provide necessary inputs, support and information to prepare Proposal. Note: 1 It is recognized that either due to specifics of organizational structure of certain GMs or due to organizational changes over time, specific position titles of individuals in the roles described herein may change, however, neither the roles nor responsibilities shall be altered materially and all process steps shall be taken in outlined sequence. 2 In absence of dedicated GM BD/Sales, GM shall designate a person within the GM’s organizational structure responsible for performance of relevant duties and responsibilities. Sometimes, such responsibilities are assigned to Operations Managers or to Country Managers. 3 This term collectively refers to a manager with P&L authority for a specific organizational division within the GM (including General Managers, Country Managers, Location/Site Managers, Operations Managers, etc. as may be applicable), who is responsible for approvals in accordance with applicable Delegation of Authority standard. 6. Proposal Management Process Flow: a. Process Map: The following illustration provides the basic flow for the Proposal Management process: Proposal Management CCM PersonnelGM BD / SalesProposal Team GM VPELTPhase2. Pursue?3. Send Notice of Intent to Customer5. Review Project Requirements or Tender DocumentsClarifications6. Summarize Requirements & Accountability MatrixCC.FOR.0017. Distribute Documents & Credit Check8. Consolidate Input9. Prepare Proposal Submittal Package10. Establish Dates for Proposal Reviews as Required11. Conduct Peer Review1. Start18. End12. ELT Review Required?12B. ELT Approved?13. Incorporate Comments & Recommendations15. Submit Proposal16. Post-Submission Activities. Respond to Clarification Requests17. Accepted / Award?17A. Receive Letter of Intent/Award or Equivalent17B. Conduct Interview with CustomerCC.FOR.0042A. Notify Customer & Decline 12A. Conduct ELT Review14. Approve?NOYESNO4. Assemble a Proposal TeamYESNOYESNOWINLOSEYESYES b. Process Steps: The following table outlines the steps of the Proposal Management process: Step No. Step Title Description 1 Start GM BD receives customer request or finds an opportunity for an unsolicited proposal through awareness of customer project requirements and/or other intelligence; GM BD receives, collects and uploads (or causes to be uploaded) all relevant documents to SharePoint database (refer to Appendix A for electronic filing instructions) and informs CCM personnel about potential new proposal. If the underlying opportunity has not been previously processed and approved, GM BD may be required to complete necessary activities in accordance with BD.PRO.002 – Opportunity Management process. This includes completion of “Know Your Customer Form”, if required. 2 Pursue? A decision to either pursue and prepare a proposal or decline participation in the project shall be made in accordance with opportunity approval authority considerations set forth in Section 1 of Appendix B hereto. Approving officer(s) shall communicate this decision in writing (through the workflow in Salesforce or by e-mail). GM BD shall appropriately record the decision in the Salesforce.  If YES, go to Step 3  If NO, go to Step 2A 2A Notify customer & Decline GM BD or CCM personnel, who is assigned as a focal point for communications with customer, sends a decline notice or otherwise notifies customer of intention not to submit a proposal, informs all internal stakeholders, makes necessary records in Salesforce and ensures related documents are posted in SharePoint database. 3 Send Notice of Intent to Customer If the decision is to prepare a proposal, GM BD or CCM personnel, who is assigned as a focal point for communications with customer, sends a Notice of Intent to customer, informs all internal stakeholders, makes necessary records in Salesforce and posts such Notice of Intent in SharePoint database. 4 Assemble Proposal Team GM BD, GM VP, and CCM Personnel work together to establish Proposal Team. Proposal Team typically consists of GM Operations, GM BD, CCM personnel, GM Finance Manager, Operations Finance, Technical Services personnel as needed. For unsolicited proposals this complement may be reduced, however it shall always include CCM personnel. In addition, a single point of contact is nominated for customer communications (usually GM BD or CCM Personnel). This contact obtains clarifications from customer as required and distributes responses to all members of the Proposal Team and other internal stakeholders as may be required. Proposal Team is encouraged to use MS Teams as much as possible as a collaborative space for contract reviews (redlines), working on the documents, spreadsheets, etc. which require input from multiple Support Functions; provided that the final submission package of the Proposal and the commercial model (bid sheet) are posted in SharePoint as set forth in Step 15. 5 Review Project Requirements or Tender Documents. Clarifications Proposal Team reviews customer project specific requirements or tender documents If any customer project specific requirements or tender requirements are unclear and/or require clarification, all clarification requests shall be collected and communicated to the customer by the designated point of contact. If customer’s tender documents establish clarification process protocol, such protocol shall be adhered to at all times. Similarly, customer’s responses to clarification requests shall be disseminated to the Proposal Team by the designated point of contact and posted on SharePoint. 6 Summarize Requirements & Develop Accountability Matrix (CC.FOR.001) Based on review of customer’s project specific requirements or tender documentation, CCM personnel jointly with GM BD summarizes the requirements and develops Accountability Matrix as per form CC.FOR.001 with individual assignment of relevant sections, expected deliverables/feedback and due dates to members of Proposal Team and other functional area departments. Preparation of Accountability Matrix for unsolicited and direct negotiation Proposals is recommended as a good business practice. Unsolicited Proposals: In the absence of a formal request from a customer, GM BD is responsible to: a) ensure that Proposal Team has relevant and sufficient customer project requirements to enable the Proposal preparation; b) timely and fully inform Proposal Team of all the pertinent developments related to the project and proposal preparation; and c) ensure that CCM personnel are always involved in unsolicited proposal preparation process. 7 Distribute Documents & Perform Credit Check (if required) CCM personnel distribute the documents alongside with CC.FOR.001 Accountability Matrix to Proposal Team and relevant Support Functions. Such Support Functions shall include:  Support Function personnel assigned to GM, as applicable  CCM  Legal (also serves as interface with Compliance)  Risk Management, Tax and Treasury  Operations Integrity and Sustainability  Technical Services  Operations Support, and - Other functions as deemed necessary (HR, Asset Management, SCM, Maintenance, etc.). Distribution of the documents may be accompanied by a kick-off meeting with participation of Proposal Team and Support", "8": "Functions. Please refer to CC.TEM.001 - Kick-off Meeting Presentation Template. Although a formal kick-off meeting and the use of the presentation template is encouraged, it is optional. At this stage of the process, CCM personnel requests Corporate Treasury group to perform a credit check on any new customer or an existing customer (if there is reasonable assumption that its financial position might have weakened) and reflect the results in the relevant Proposal’s file in SharePoint. 8 Consolidate Input CCM personnel collect, upload, update, generally maintain, and complete set of documentation related to a Proposal under consideration, including pertinent tender documents or important project details, final version of the commercial model (bid sheet), records of internal reviews and work documents in the SharePoint database as per existing procedures (refer to Appendix A for electronic filing instructions.) 9 Prepare Proposal Submittal Package Ref. Appendix C, Proposal Deliverables Proposal Team prepares Proposal submittal package, that typically includes inputs on the following:  Definitions of requirements (including Scope of Work and Responsibilities) – GM Operations;  Contractual terms and conditions (commercial and legal) – CCM and Legal personnel;  Commercial rate structure – CCM personnel in cooperation with GM BD / Sales, Corporate FPA and other Support Functions, as may be required, suggests preferable commercial rate structure;  Equipment specifications – GM Operations, and  Commercial model (bid sheet) – GM Finance, Corporate FPA, CCM personnel and GM BD / Sales. For the general outline of the Proposal’s structure, please refer to Appendix C Proposal Deliverables suggesting sections that shall comprise the Proposal in case customer is not prescribing the submission content. Appendix C Proposal Deliverables also recommends some documents that may be included to emphasize the value proposition of the Proposal. In collaboration with P&L Manager and CCM personnel, GM BD develops and forwards salient points of recommended Proposal to the GM VP for review and makes available other elements of submittal package if required by GM VP. GM BD records such salient points and recommendations in Salesforce. 10 Establish Dates for Proposal Reviews as Required Every commercial Proposal, prepared either through a formal tender process or direct negotiation, MUST be reviewed at appropriate organizational levels and approved by the authorized officer(s). There may be multiple tiers of Proposal reviews and approvals required depending on the criteria set forth in Section 2 of Appendix B, including:  Peer Review (either Internal GM ’s Review or Extended Peer Review), and/or  ELT Review, and/or  Board of Directors’ (BOD) Review. GM BD advises GM VP of the requirements for Peer Review and/or ELT Review and proposes the dates consistent with Steps 11 and 12 of the Process. If a BOD Review is required, GM VP shall defer to the COO and CEO to determine participants, their availability, date and format of the BOD Review meeting. Lists of mandatory and recommended/optional participants for each tier of Proposal reviews are provided in Section 2 of Appendix B. 11 Conduct Peer Review 1 [No later than 7-5 days prior to submission] GM BD is responsible for organizing and scheduling Peer Review and ensuring all participants are timely notified.  Under normal circumstances Peer Review, either Internal GM’s Review or Extended Peer Review, shall be held no later than 7-5 business days prior to the date of Proposal submission (or Proposal dispatch date as may be applicable).  GM BD / Sales prepares Peer Review Presentation in accordance with the standards for the content as set forth in the Peer Review Presentation Template. Please refer to CC.TEM.002 – Peer Review Presentation Template.  GM BD / Sales, together with P&L Manager when applicable, presents Proposal strategy and financial assumptions on behalf of Proposal Team.  Peer Review participants reviews Proposal for strategic fit, competitiveness, acceptable financial assumptions and any special criteria, including, but not limited to:  Mobilization and Demobilization;  AFE required for complying with customer project requirements;  Costs not recoverable during the firm term of project (including Early Termination);  Competition analysis of market rates, competitive environment and assessment of Proposal competitiveness;  Other project specific special criteria.  Peer Review participants provide their comments and recommendations to the presented Proposal.  CCM personnel shall minute Peer Review, review the minutes with GM BD / Sales, post them on SharePoint and make appropriate entries in Salesforce. In absence of assigned CCM personnel at the Peer Review meeting, GM BD / Sales or his/her designate shall complete this step. Note: 1 If Peer Review cannot be conducted due to time constraints or such other good cause considerations, a deviation from this process requirement is permissible, provided, however, that all of the following conditions are fulfilled: 1) Summary of Proposal is prepared substantially in the form of Peer Review Presentation Template and presented to the appropriate Peer Review participants no later than forty-eight (48) hours prior to Proposal submission. 2) Recommendations and comments provided by the Peer Review participants are adequately addressed and incorporated as required by revising the Proposal as described in Step 13. 3) Proposal is reviewed and approved by the authorized officer(s) as set forth in Section 2 of Appendix B and approvals are documented in writing and timely communicated to the CCM personnel and GM BD / Sales as described in Step 14. 12 ELT Review Required? ELT Review shall be conducted if relevant criteria are met as described in Section 1 of Appendix B.  If YES, go to Step 12A  If NO, go to Step 13 12A Conduct ELT Review [Not later than 2-3 days prior to Proposal submission] GM BD / Sales is responsible for organizing and scheduling ELT Review and ensuring all participants are timely notified.  Under normal circumstances, ELT Review shall be held no later than 2-3 business days prior to the date of Proposal submission (or proposal dispatch date as may be applicable).  ELT Review Presentation shall follow same standards and principles as Peer Review Presentation.  At this stage, Proposal shall be revised and adjusted in accordance with recommendations received from the participants during Peer Review.  GM BD / Sales, together with P&L Manager when applicable, makes presentation of the Proposal by addressing the same salient points that have been covered during the Peer Review meeting.  ELT Review participants provide their comments and recommendations to the presented Proposal.  CCM personnel, if present, or GM BD /Sales shall minute ELT Review and distribute minutes to the meeting participants, post them on SharePoint and make appropriate entries in Salesforce. 12B ELT Approved? Did the ELT approve the Proposal submission?  If YES, go to Step 13  If NO, go to Step 18 13 Incorporate Comments & Recommendations CCM personnel in coordination with GM BD / Sales revise the Proposal based on comments and recommended adjustments from Peer Review and ELT Review (as may be applicable). 14 Approve? GM BD / Sales shall secure necessary approval(s) for the Proposal in accordance with Delegation of Authority standard and communicate the Proposal Team in writing that such approval(s) have been received and record same in Salesforce.  If YES, go to Step 15  If NO, go to Step 18 No Proposal shall be submitted absent written approval of the authorized officer(s) in accordance with Delegation of Authority standard. Note: If a Proposal is being submitted on behalf of a legal entity within Parker Drilling’s Netherlands group of companies’ structure, or a joint venture, etc. GM would be required to work with Corporate Legal group to secure formal approval of directors of such legal entity for Proposal submission. 15 Submit Proposal  CCM personnel assemble final Proposal package and submit (or cause to submit) the Proposal as applicable. If communication with a customer is assigned to GM BD / Sales, then he or she becomes responsible for this step.  CCM personnel file submission documents in SharePoint per existing procedures (refer to Appendix A for electronic filing instructions). Proposal documents shall be retained in accordance with document retention policy. If the final submission package of the Proposal and the commercial model (bid sheet) are posted in MS Teams, at this time such documents must be posted in SharePoint and a link shall be included in the opportunity record in Salesforce.  CCM personnel update opportunity record in Salesforce. 16 Post-Submission Activities. Respond to Clarification Requests  A designated point of contact nominated for communication with customer (CCM personnel or GM BD / Sales) maintains contact with the client throughout Proposal evaluation process and shares information about such communications with Proposal Team.  CCM personnel are responsible for reaching out to the relevant functions for preparation of responses to Post-Submission Clarification Requests as necessary. CCM personnel obtain the inputs from the Proposal Team or other Support Functions, compile responses to customer’s questions and/or clarification requests, obtain validation from GM BD / Sales, and the designated point of contact nominated for customer communications submits the responses to the customer.  When and if - in the course of clarification process - key parameters of the original Proposal (i.e. profitability, EBITDA, revenue, CapEx and OpEx assumptions, etc.) change, CCM personnel shall review and establish if an approval for either change of Proposal or withdrawal of Proposal is required from an authorized officer(s) with appropriate delegated authority limit as applicable in accordance with criteria set forth in Section 2 of Appendix B. If such approval is required, CCM personnel in collaboration with GM BD / Sales develop the request for such approval and send it to the authorized officer(s). Upon the receipt of the response CCM personnel document it in Salesforce. Note: The decision to amend or withdraw Proposal needs to take into consideration the conditions of the Proposal and associated liabilities (i.e. bid bonds, guarantees, other forms of financial assurance).  CCM or GM BD / Sales personnel update opportunity record in Salesforce and uploads all relevant documents to SharePoint. 17 Accepted / Award? A designated point of contact is notified of the outcome of customer’s evaluation process.  If Proposal is Accepted, go to Step 17A  If Proposal is NOT Accepted, go to Step 17B 17A Receive Letter of Intent/ Reward or equivalent A designated point of contact receives Letter of Intent / Award or equivalent Go to Step 18 and Contracting Process – CC.PRO.002 – Contracting process. 17B Conduct Interview with Customer If Proposal is not accepted, GM BD / Sales shall conduct an interview with customer in order to find out the reasons for the loss. CCM personnel record and publish in SharePoint pertinent points, lessons learned, and informs Proposal Team. GM BD / Sales updates opportunity entry in Salesforce. 18 End End of Proposal Management Process 7. Related Documents: a. BD.PRO.002 – Opportunity Management b. CC.PRO.002 – Contracting Process c. FN.STD.002.20 – Delegation of Authority (DOA) 8. Appendices: A – Electronic Filing Instructions B – Authority Considerations: Approval to Pursue Opportunity and Tiers of Proposal Review and Approval C – Proposal Deliverables, Drilling Services 9. Forms: a. CC.FOR.001 – Accountability Matrix b. CC.TEM.001 – Kick-off Meeting Presentation Template c. CC.TEM.002 – Peer Review Presentation Template 10. Revision History: Rev Date Author Approval Notes 4 02/21/2007 LR CD Issue date 08/01/2003 0 04/23/2015 S. Buben M. Sanchez Substantially revised QP07501 Contract Tender Process International Operations 0 11/06/2020 S. Buben J. Simons Document transitioned to be aligned with Geo-Market organizational structure and formation of CCM Department. The document control revised with the new functional code CC from previously BD functional process BD.PRO.003 Tender Management to CC.PRO.001 Proposal Management. 1 12/16/2020 S. Buben J. Simons Minor changes to reflect functional code to form number CC.FOR.004 Tender Accountability Matrix and Template BD.TEM.001 to CC.TEM.002 Peer Review Presentation Template. 2 12/07/2022 E. Yevgrafov J. Lochridge Major process overhaul, including the revisions to eliminate obsolete steps and forms; streamline process flow; and update the document to reflect new PW brand. APPENDIX A – ELECTRONIC FILING INSTRUCTIONS Standard Electronic Filing System in SharePoint 1) Shared Documents> Tenders All Tenders", "9": "Geomarket  Country  Clients  Name of Specific Project/Tender/Opportunity in the following format: [YYYY-MM-DD]_EOI/SOI/INQ/ITT/PQF/RFP/RFQ_[Project Name]  Clarifications  Pre-Tender  Post-Tender  ITT/RFP/RFQ//EOI/SOI/INQ/ITT/PQF Docs  Process Documents  Work Documents  Commercial  Technical  Contractual  Commercial Model / Bid sheets  Submittal Docs  Commercial  Technical 2) Shared Documents> Contracts Geomarket  Country  Clients  Contract Name in the following format: [YYYY-MM-DD]_[Customer]_[Project Name/Rig No.]_[Contract Number]  Amendments  Change Orders  Contract Documents  Contractual Correspondence APPENDIX B – AUTHORITY CONSIDERATIONS: APPROVAL TO PURSUE OPPORTUNITY AND TIERS OF PROPOSAL REVIEW AND APPROVAL Section 1 - Approval to Prepare a Proposal In order to determine an appropriate level of authority within PW’s organizational structure required for approval of GM’s decision to pursue an opportunity, each opportunity shall be carefully assessed against the criteria, which are generally two-fold:  Asset relocation or new market entry considerations (items A through E in the table below); and  Project estimated capital expenditure considerations as per Delegation of Authority (items F through I in the table below). Given that multiple levels of approval may be required for an individual opportunity, GM’s decision to pursue opportunity shall be reviewed and approved by the authorized officer(s) with the highest level of authority required. Section 2 – Proposal Review and Approval Tiers Every Proposal MUST be reviewed at appropriate organizational levels and approved by the authorized officer(s) before such Proposal can be delivered to the customer. Criteria used to determine what tiers of Proposal review and approval may be required are similar to the ones used to determine whether an opportunity shall be pursued by the GM. In order to determine whether a Proposal requires an Internal GM Review, an Extended Peer Review or higher levels of review and approval (ELT Review and BOD Review), please refer to the table below. Level(s) of Approval Authority Required (Authorized Officers) Approval to Prepare Proposal Approval of Final Proposal GM VP Sr. VP of Global Operations (COO) Chief Executive Officer (CEO) Board of Directors (BOD) Tiers of Proposal Review Required Internal GM Review Extended Peer Review ELT Review BOD Review Asset Relocation and New Market Entry Considerations (A) Asset remains or new service is offered within the same country X (B) Asset moves to or new service is offered in a country with the established presence within the same GM X (C) Asset moves to a country in a different GM X X (D) Asset moves to or new service is offered in a new country with no established presence X X X (E) Pursued opportunity would ultimately require establishing permanent presence in a new country X X X Project Estimated Capital Expenditure (F) CapEx within the approved budget for GM X (G) CapEx within the approved budget for the Drilling organization X X (H) CapEx above the approved budget for GM up to $2MM X X (I) Any CapEx over $2MM X X X Section 3 – Recommended Review Participation by Tiers The table below contains the guidelines for determining required quorum of participants for each tier of Proposal review as optional attendees: Mandatory Participants Recommended/Optional Participants Internal GM Review - GM Personnel, including: - GM VP; - GM BD/Sales; - Regional Account Directors (where applicable);  Other GM personnel (at the discretion of GM Regional BD;  Subject matter experts from Support Functions (at GM’s discretion). - GM Finance Controller/Manager; - GM Operations Manager; - GM Contracts Manager or CCM personnel; - P&L Manager; - Relevant Product Line Manager; - Relevant Country/Division Finance Manager; - Individual responsible for preparation of commercial model (bid sheet) (if different from above listed). Extended Peer Review  Internal GM Review Mandatory Participants;  Sr. VP of Global Operations;  Director CCM;  Corporate Support Functions including: - Legal/Compliance; - CCM personnel; - Operations; - Financial Planning Analyst; - Tax;  Other GM’s (as required).  Corporate Support Functions including: - Technical Services (as required); - Human Resources; - Operations Integrity and Sustainability ; - Treasury; - Risk. ELT Review  ELT;  Sr. VP of Global Operations;  Director CCM;  GM Personnel, including: - GM VP; - GM BD/Sales; - GM Finance Controller/Manager.  At discretion of Sr. VP of Global Operations. BOD Review  At discretion of ELT.  At discretion of ELT. APPENDIX C – PROPOSAL DELIVERABLES, DRILLING SERVICES Parker Drilling Proposals structure may vary depending on customer’s requirements but shall be ultimately tailored to suit customer’s needs and instructions as prescribed in the Invitation to Tender (ITT), Request for Proposal (RFP), Request for Quotation (RFQ), Pre-Qualification (PQF), Solicitations of Interest (SOI), Expression of Interest (RFI), and Inquiry (INQ) etc. Typically, a Proposal would feature the following components: a. Technical, collectively referring to any information describing scope of work/services GM is offering to deliver; any drilling rigs and/or rental equipment that will be used to deliver services (i.e. equipment inventory and technical specifications); allocation of responsibilities between contacting parties (aka. ‘Matrix of Responsibilities’); startup/mobilization schedules and logistics; manpower, etc. b. Contractual, collectively referring to contractual terms and conditions, which would lay out framework for future transaction. In absence of customer’s draft contract with customer preferred contractual terms and conditions) and given that customer has requested so, Proposal Team will work to prepare an appropriate draft contract model based on standard forms of contracts with Parker’s preferred terms and conditions available with Corporate CCM group (e.g. International Dayrate Drilling Contract, O&M Master Drilling Contract, Lease Agreement or Master Drilling Agreement – select as appropriate in: https://insideparker.parkerdrilling.com/depts/bd/Shared%20Documents/Forms/All%20Documents%20BD.aspx?RootFolder=%2Fdepts%2Fbd%2FShared%20Documents%2FTechnical%20Library%20%2D%20Resources%2FContract%20Forms&FolderCTID=0x012000BA0820B3D9D26F4E961ABC6E470DB77A&View=%7B73159DCF%2D4EEF%2D47DD%2D9F1A%2D37DB1F576D75%7D Generally, for solicited Proposals, customers include draft contract in the tender documents when a tender is released. If a draft contract has been included, members of Proposal Team are required to review it in accordance with the internal guidelines and practices for contracting. It is imperative that CCM and Legal/Compliance at both Corporate and GM’s levels perform a comprehensive review of the entire draft contract to the extent practicable. Although a comprehensive review of the draft contract by other Support Functions on Proposal Team is recommended, their review may still be limited to that of relevant sections only, either within the main body of the contract or attachments/exhibits (e.g. Operations need to review and provide their observations with regard to the scope of work/services, allocation of responsibilities between contracting parties, Operations Integrity and Sustainability to review HSE and/or Quality pertinent sections, Risk Management to review insurance requirements, etc.) c. Commercial, collectively referring to any pricing information, including – for example - daily rates, lump sum fees and other charges (e.g. equipment rental rates, call-out rates for specialized manpower, etc.). All commercials shall be based on the commercial model (aka. ‘Bid Sheet’) and shall be easily decipherable (calculable, or formula-based, and not hard-keyed). Developing and maintaining an up-to-date version of bid model at all times is central to preparation of any commercial Proposal. This process starts immediately after tender documents or project specific requirements are distributed to Proposal Team and continues as the Proposal is being developed. The parties responsible for commercial model preparation shall keep CCM personnel appraised of their work to ensure the alignment of the commercial model to contractual redlines and structure."}